Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Договор.ДетализацияРасчетов = Перечисления.ТипыДетализацииРасчетов.ПоРасчетнымДокументам Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Расчеты.Итог("Сумма") > СуммаСНДС Тогда
			Сообщить("Ошибка при проведении " + Ссылка + ", сумма расчетов больше суммы документа");
			Отказ = Истина;
		КонецЕсли;
		
	Иначе
		Расчеты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Касса = Константы.КассаПоУмолчанию.Получить();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РасчетыСКонтрагентами.Записывать = Истина;
	
	Если Договор.ДетализацияРасчетов = Перечисления.ТипыДетализацииРасчетов.ПоРасчетнымДокументам Тогда
		
		ОставшаясяСумма = СуммаСНДС;
		
		Для А = 0 По Расчеты.Количество() - 1 Цикл
			
			Движение = Движения.РасчетыСКонтрагентами.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.РасчетныйДокумент = Расчеты[А].РасчетныйДокумент;
			Движение.Сумма = Расчеты[А].Сумма;
			
			ОставшаясяСумма = ОставшаясяСумма - Расчеты[А].Сумма;
			
		КонецЦикла;
		
		Если ОставшаясяСумма <> 0 Тогда
			Движение = Движения.РасчетыСКонтрагентами.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.РасчетныйДокумент = Ссылка;
			Движение.Сумма = ОставшаясяСумма;
		КонецЕсли;
		
	Иначе
		Движение = Движения.РасчетыСКонтрагентами.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = СуммаСНДС;
	КонецЕсли;
	
	Движения.ДенежныеСредства.Записывать = Истина;
	
	Движение = Движения.ДенежныеСредства.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.ДенежнаяЯчейка = Касса;
	Движение.Сумма = СуммаСНДС;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
