&НаКлиенте
Процедура ОткрытьВФормеБезОбязательногоИспользованияТабличныхЧастей(Команда)
	
	ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.Форма.ФормаДокументаБезОбязательногоИспользованияТабличныхЧастей", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВФормеБезИтогов(Команда)
	
	ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.Форма.ФормаДокументаБезИтогов", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВФормеБезТабличныхЧастей(Команда)
	
	ОткрытьФорму("Документ.ПоступлениеТоваровИУслуг.Форма.ФормаДокументаБезТабличныхЧастей", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
	
КонецПроцедуры
