Функция Ping()
	
	Возврат Истина;
	
КонецФункции

Функция Get()
	
	Узел = Константы.УзелВебСервисаОбменСБП.Получить();
	
	Результат = Новый ЗаписьXML;
	Результат.УстановитьСтроку();
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(Результат, Узел);
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, ЗаписьСообщения.НомерСообщения);
	
	Пока ВыборкаИзменений.Следующий() Цикл
		ОбъектОбмена = ВыборкаИзменений.Получить();
		ЗаписатьXML(Результат, ОбъектОбмена);
	КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();
	
	Возврат Результат.Закрыть();
	
КонецФункции

Функция DeleteRegistration()
	
	Узел = Константы.УзелВебСервисаОбменСБП.Получить();
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
	Возврат Истина;
	
КонецФункции
