Процедура УстановитьПараметрСеансаТекущийПользователь() Экспорт
	
	ИнициализируемУстановкуПараметраСеансаТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Функция ПолучитьГраницуИсключаяДокумент(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.Ссылка) Тогда
		Возврат Документ.Дата;
	ИначеЕсли Документ.Дата <> Документ.Ссылка.Дата Тогда
		Возврат Документ.Дата;
	Иначе
		Возврат Новый Граница(Документ.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
КонецФункции

Процедура ВосстановлениеПоследовательностиПартионныйУчет() Экспорт
	
	Последовательности.ПартионныйУчет.Восстановить();
	
КонецПроцедуры
