&НаКлиенте
Процедура ОчиститьЛог(Команда)
	
	Объект.Ответ = "";
	
КонецПроцедуры

&НаКлиенте
Процедура Ping(Команда)
	
	PingНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Get(Команда)
	
	GetНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура DeleteRegistration(Команда)
	
	DeleteRegistrationНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура PingНаСервере()
	
	Объект.Ответ = Объект.Ответ + "Ping: " + ПолучитьСоединение().Ping() + Символы.ПС;
	
КонецПроцедуры

&НаСервере
Процедура GetНаСервере()
	
	Объект.Ответ = Объект.Ответ + "Get: " + ПолучитьСоединение().Get() + Символы.ПС;
	
КонецПроцедуры

&НаСервере
Процедура DeleteRegistrationНаСервере()
	
	Объект.Ответ = Объект.Ответ + "DeleteRegistration: " + ПолучитьСоединение().DeleteRegistration() + Символы.ПС;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоединение()
	
	Определения = Новый WSОпределения(Константы.АдресВебСервисаОбменСБП.Получить(), Константы.ПользовательВебСервисаОбменСБП.Получить(), Константы.ПарольВебСервисаОбменСБП.Получить());
	Прокси = Новый WSПрокси(Определения, Определения.Сервисы[0].URIПространстваИмен, Определения.Сервисы[0].Имя, Определения.Сервисы[0].ТочкиПодключения[0].Имя);
	Прокси.Пользователь = Константы.ПользовательВебСервисаОбменСБП.Получить();
	Прокси.Пароль = Константы.ПарольВебСервисаОбменСБП.Получить();
	
	Возврат Прокси;
	
КонецФункции
